'''
Пользователь вводит данные о количестве предприятий, их наименования и прибыль за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.. Программа должна определить среднюю прибыль (за год для всех предприятий) и вывести наименования предприятий, чья прибыль выше среднего и отдельно вывести наименования предприятий, чья прибыль ниже среднего.
'''


ind_cn = int(input('Количество предприятий: '))

ind_name = {}

year_sum = 0

for i in range(ind_cn):
	name = input('Название предприятия: ')
	q = 4
	ysum = 0
	for j in range(q):
		qsum = int(input('Выручка за {}-й квартал: '.format(j+1)))
		ysum += qsum
	ind_name[name] = ysum
	year_sum += ysum

mid_cash = year_sum/ind_cn
for i in ind_name:
	print('Годовая выручка предприятия {} больше средней'.format(i) if ind_name[i] > mid_cash else'Годовая выручка {} предприятия меньшей средней'.format(i))
